app/controllers/main_controller.rb

SELECT * FROM "users" WHERE (username = 'tylergillies' AND host = 'localhost') LIMIT 1
INSERT INTO "users" ("created_at", "subscriptions", "profile", "updated_at", "picture_url", "username", "profile_url", "foaf_location", "host", "password", "email") VALUES('2010-03-29 20:44:45', NULL, NULL, '2010-03-29 20:44:45', NULL, 'tylergillies', NULL, NULL, 'localhost', NULL, NULL)
---
  def set_username

    @user = User.find_by_username("tylergillies")
    @user ||= User.create(:username => "tylergillies", :host => "localhost")

SELECT * FROM "users" WHERE ("users"."id" = 5)
SELECT * FROM "statuses" WHERE ("statuses".user_id = 1)
SELECT * FROM "users"
---
  def main
    @subs = []
    @user.subscriptions = [] if @user.subscriptions.nil?
    @user.subscriptions.each do |sub|
      @subs << "<img src='#{sub[:image]}' width=48 height=48>"
    end
     @statuses = []
     @user.subscriptions.each do |sub|
       user = User.find(:first, :conditions => "username = '#{sub[:user]}' AND host = '#{sub[:host]}'")
       user.statuses.each do |status|

UPDATE "users" SET "updated_at" = '2010-03-24 12:11:51', "subscriptions" = '---
---
                             :host => host,
                             :image => image,
                             :profile => finger.profile_page.first.to_s } if match.nil?
    @user.save

SELECT * FROM "statuses" WHERE ("statuses".user_id = 19)
---

    entries = []

    user.statuses.each do |status|

SELECT * FROM "statuses" WHERE ("statuses".user_id = 1)
---
  def users
    username = params[:username]
    user = User.find(:first, :conditions => "username = '#{username}' AND host = 'localhost'")
    if user.nil?
      render :text => "no such user", :status => 400 and return
    end

    statuses = user.statuses.map(&:title).reverse.join("<p>")